/**
 * desc: 过滤器
 * User: Renjian.Tang/renjian.tang@gymboglobal.com
 * Date: 2020/2/12
 * Time: 下午2:03
 */

class Filter {
    /**
     * 任务类型
     * @param {string} type
     * @returns {string | undefined}
     */
    static formatTaskStatus(type:string){
        const map = new Map([
            ['61002', '联系成功'],
            ['61003', '联系未果 - 停机'],
            ['61004','联系未果-无人接听'],
            ['61005','联系未果-错/空号'],
            ['62002','已到访'],
            ['62003','未到访'],
            ['63002','已签约'],
            ['63003','未签约'],
            ['65001','待完成'],
            ['65002','已完成'],
            ["95001", "拒绝-没有需求"],
            ["95002", "拒绝-已报其他品牌"],
            ["95003", "拒绝-孩子太小"],
            ["95004", "拒绝-不在所属区域"],
            ["95005", "未诺访，待跟进"],
            ["95006", "错/空号"],
            ["95007","联系未果-停机"],
            ["95008", "联系未果-无人接听"],
            ["95009", "其他"],
            ["96001", "参观"],
            ["96002", "试听"],
            ["96003", "活动"],
            ["96004", "测评"],
            ["97001", "已试听"],
            ["97002", "定金"],
            ['98001','接通再跟进-在忙'],
            ['98002','接通再跟进-挂起'],
            ['98003','接通无效-客户拒绝'],
            ['98004','接通无效-不符合目标客户'],
            ['98005','接通无效--已选择其他品牌'],
            ['98006','接通无效--不在所属区域'],
            ['98007','接通无效--虚假信息'],
            ['98008','接通无效--其他'],
            ['98101','接通有效-诺访-参观'],
            ['98102','接通有效-诺访-试听'],
            ['98103','接通有效-诺访-活动'],
            ['98104','接通有效-诺访-测评'],
            ['98201','接通有效-到访-已试听'],
            ['98202','接通有效-到访-定金'],
            ['99001','未接通-未接通再利用'],
            ['99002','未接通-未接通无效'],
            ['99003','未接通-空号'],
            ['default', '-'],

        ]);
        return map.get(type) ? map.get(type): map.get('default');
    }
}

export {Filter}
