/**
 * desc: 接口返回码
 * Date: 2018/8/2
 * Time: 上午9:22
 */
enum StatusCode {
    成功 = 1,
    错误 = 0,
    用户过期 = 2,
    其他异常 = 9000,
    用户名或密码错误 = 9001,
    新密码不能跟就密码相同 = 9002,
    更新密码失败 = 9003,
    密码过期 = 9004,
    验证码错误 = 9005,
    验证码失效 = 9006,
    账号新设备登陆 = 9007,
    账号异地登陆 = 9008,
    发送验证码失败手机号码为空 = 9009,
    发送验证码失败手机号码错误 = 90010,
    验证码提交频繁 = 90011,
    账号被锁定联系POP = 90012,
    账号被锁定联系CD = 90013,
    获取间隔未超过60S = 90014,
    用户离职 = 90015,
    首次登录 = 90017,
    账号未绑定 = 90018,
    账号已锁定 = 90019

}

export {StatusCode}
