export const leadsStatus = {
  "放弃":"0",
  "待分配":"1",
  "已分配":"2",
  "已领取":"3",
  "已联络":"4",
  "诺访":"5",
  "已到访":"6",
  "新会员":"7",
  "老会员":"8",
  "待续会员":"9",
  "历史会员":"10",
};
let leadsStatusCode={};
for(let key in leadsStatus){
    leadsStatusCode[leadsStatus[key]]=key;
}
export default leadsStatusCode;
export const taskThemeCode = {
  '联系' : '70001',
  '面谈' : '70002',
  '签约' : '70003',
  '其他' : '70004',
  'TMK' : '70005',
  '云语音' : '70006',
  'TMK转入中心跟进' : '70007',
  'TMK首次转入中心跟进' : '70008',
  '转至TMK跟进' : '70009',
}

export const taskStatus = {
    '联系成功' : '61002',
    '已到访' : '62002',
    '待完成' : '65001',
    '联系未果-停机':'61003',
    '联系未果-无人接听':'61004',
    '联系未果-错/空号':'61005',
    '未到访':'62003',
    '已签约':'63002',
    '未签约':'63003',
    '已完成':'65002',

    '拒绝-没有需求':'95001',
    '拒绝-已报其他品牌':'95002',
    '拒绝-孩子太小':'95003',
    '拒绝-不在所属区域':'95004',
    '未诺访，待跟进':'95005',
    '联系未果-错-空号':'95006',
    '联系未果/停机':'95007',
    '联系未果/无人接听':'95008',
    '其他':'95009',
    '参观':'96001',
    '试听':'96002',
    '活动':'96003',
    '测评':'96004',
    // new
    '接通再跟进-在忙': '98001',
    '接通再跟进-挂起': '98002',
    '接通无效-客户拒绝': '98003',
    '接通无效-不符合目标客户': '98004',
    '接通无效--已选择其他品牌': '98005',
    '接通无效--不在所属区域': '98006',
    '接通无效--虚假信息': '98007',
    '接通无效--其他': '98008',
    '接通有效-诺访-参观': '98101',
    '接通有效-诺访-试听': '98102',
    '接通有效-诺访-活动': '98103',
    '接通有效-诺访-测评': '98104',
    '接通有效-到访-已试听': '98201',
    '接通有效-到访-定金': '98202',
    '未接通-未接通再利用': '99001',
    '未接通-未接通无效': '99002',
    '未接通-空号': '99003',

}

export const eventType = {//关键事件类型
    "77001": "里程碑",
    "77002": "恳谈会",
    "77003": "迎新会",
    "77004": "升班记录",
    "77005": "意外事件",
    "77006": "非活跃会员黑名单",
    "77007": "非活跃会员黑名单取消",

};

export const priority= {
    '紧急' : '68002',
    '正常' : '68001',
};

export const reNewStatus=[//续约状态
    {
        name:'已续',
        value:'78003'
    },
    {
        name:'已定',
        value:'78002'
    },
    {
        name:'待定',
        value:'78001'
    },

];
